import time
import logging

from abc import ABC
from urllib.parse import urljoin
from typing import List, Union, Tuple, AnyStr

from scrapy.http import Response
from scrapy import Spider, Selector, Request
from scrapy.loader import ItemLoader
from scrapy_selenium import SeleniumRequest
from selenium.webdriver.firefox.webdriver import WebDriver
from selenium.common.exceptions import NoSuchElementException

from buc_crawler.xpaths import DGisMapPath
from buc_crawler.items import CompanyItem

logger = logging.getLogger(__name__)

xpath: DGisMapPath = DGisMapPath()


class DGisSpider(Spider, ABC):
    name = '2gis'

    def __init__(self, categories: Union[List, Tuple, AnyStr] = None, cities: Union[List, Tuple, AnyStr] = None,
                 **kwargs):
        super(DGisSpider, self).__init__()
        self.categories = "Металлопрокат,Строительная компания,Торгово-производственная компания,Строительные " \
                          "материалы,Чёрный металлопрокат,Цветной металл"
        self.cities = "Абаза,Абакан,Абдулино,Абинск,Агидель,Агрыз,Адыгейск,Азнакаево,Азов,Ак-Довурак,Аксай," \
                      "Алагир,Алапаевск,Алатырь,Алдан,Алейск,Александров,Александровск,Александровск-Сахалинский," \
                      "Алексеевка,Алексин,Алзамай,Алупка,Оспаривается,Алушта,Оспаривается,Альметьевск,Амурск," \
                      "Анадырь,Анапа,Ангарск,Андреаполь,Анжеро-Судженск,Анива,Апатиты,Апрелевка,Апшеронск," \
                      "Арамиль,Аргун,Ардатов,Ардон,Арзамас,Аркадак,Армавир,Армянск,Оспаривается,Арсеньев,Арск," \
                      "Артём,Артёмовск,Артёмовский,Архангельск,Асбест,Асино,Астрахань,Аткарск,Ахтубинск,Ачинск," \
                      "Аша,Бабаево,Бабушкин,Бавлы,Багратионовск,Байкальск,Баймак,Бакал,Баксан,Балабаново," \
                      "Балаково,Балахна,Балашиха,Балашов,Балей,Балтийск,Барабинск,Барнаул,Барыш,Батайск," \
                      "Бахчисарай,Оспаривается,Бежецк,Белая Калитва,Белая Холуница,Белгород,Белебей,Белёв," \
                      "Белинский,Белово,Белогорск,Белогорск,Оспаривается,Белозерск,Белокуриха,Беломорск," \
                      "Белоозёрский,Белорецк,Белореченск,Белоусово,Белоярский,Белый,Бердск,Березники,Берёзовский," \
                      "Берёзовский,Беслан,Бийск,Бикин,Билибино,Биробиджан,Бирск,Бирюсинск,Бирюч,Благовещенск," \
                      "Благовещенск,Благодарный,Бобров,Богданович,Богородицк,Богородск,Боготол,Богучар,Бодайбо," \
                      "Бокситогорск,Болгар,Бологое,Болотное,Болохово,Болхов,Большой Камень,Бор,Борзя," \
                      "Борисоглебск,Боровичи,Боровск,Бородино,Братск,Бронницы,Брянск,Бугульма,Бугуруслан," \
                      "Будённовск,Бузулук,Буинск,Буй,Буйнакск,Бутурлиновка,Валдай,Валуйки,Велиж,Великие Луки," \
                      "Великий Новгород,Великий Устюг,Вельск,Венёв,Верещагино,Верея,Верхнеуральск,Верхний Тагил," \
                      "Верхний Уфалей,Верхняя Пышма,Верхняя Салда,Верхняя Тура,Верхотурье,Верхоянск,Весьегонск," \
                      "Ветлуга,Видное,Вилюйск,Вилючинск,Вихоревка,Вичуга,Владивосток,Владикавказ,Владимир," \
                      "Волгоград,Волгодонск,Волгореченск,Волжск,Волжский,Вологда,Володарск,Волоколамск,Волосово," \
                      "Волхов,Волчанск,Вольск,Воркута,Воронеж,Ворсма,Воскресенск,Воткинск,Всеволожск,Вуктыл," \
                      "Выборг,Выкса,Высоковск,Высоцк,Вытегра,Вышний Волочёк,Вяземский,Вязники,Вязьма," \
                      "Вятские Поляны,Гаврилов Посад,Гаврилов-Ям,Гагарин,Гаджиево,Гай,Галич,Гатчина,Гвардейск," \
                      "Гдов,Геленджик,Георгиевск,Глазов,Голицыно,Горбатов,Горно-Алтайск,Горнозаводск,Горняк," \
                      "Городец,Городище,Городовиковск,Гороховец,Горячий Ключ,Грайворон,Гремячинск,Грозный,Грязи," \
                      "Грязовец,Губаха,Губкин,Губкинский,Гудермес,Гуково,Гулькевичи,Гурьевск,Гурьевск,Гусев," \
                      "Гусиноозёрск,Гусь-Хрустальный,Давлеканово,Дагестанские Огни,Далматово,Дальнегорск," \
                      "Дальнереченск,Данилов,Данков,Дегтярск,Дедовск,Демидов,Дербент,Десногорск,Джанкой," \
                      "Оспаривается,Дзержинск,Дзержинский,Дивногорск,Дигора,Димитровград,Дмитриев,Дмитров," \
                      "Дмитровск,Дно,Добрянка,Долгопрудный,Долинск,Домодедово,Донецк,Донской,Дорогобуж,Дрезна," \
                      "Дубна,Дубовка,Дудинка,Духовщина,Дюртюли,Дятьково,Евпатория,Оспаривается,Егорьевск,Ейск," \
                      "Екатеринбург,Елабуга,Елец,Елизово,Ельня,Еманжелинск,Емва,Енисейск,Ермолино,Ершов," \
                      "Ессентуки,Ефремов,Железноводск,Железногорск,Железногорск,Железногорск-Илимский,Жердевка," \
                      "Жигулёвск,Жиздра,Жирновск,Жуков,Жуковка,Жуковский,Завитинск,Заводоуковск,Заволжск," \
                      "Заволжье,Задонск,Заинск,Закаменск,Заозёрный,Заозёрск,Западная Двина,Заполярный,Зарайск," \
                      "Заречный,Заречный,Заринск,Звенигово,Звенигород,Зверево,Зеленогорск,Зеленоградск," \
                      "Зеленодольск,Зеленокумск,Зерноград,Зея,Зима,Златоуст,Злынка,Змеиногорск,Знаменск,Зубцов," \
                      "Зуевка,Ивангород,Иваново,Ивантеевка,Ивдель,Игарка,Ижевск,Избербаш,Изобильный,Иланский," \
                      "Инза,Иннополис,Инсар,Инта,Ипатово,Ирбит,Иркутск,Исилькуль,Искитим,Истра,Ишим,Ишимбай," \
                      "Йошкар-Ола,Кадников,Казань,Калач,Калач-на-Дону,Калачинск,Калининград,Калининск,Калтан," \
                      "Калуга,Калязин,Камбарка,Каменка,Каменногорск,Каменск-Уральский,Каменск-Шахтинский," \
                      "Камень-на-Оби,Камешково,Камызяк,Камышин,Камышлов,Канаш,Кандалакша,Канск,Карабаново," \
                      "Карабаш,Карабулак,Карасук,Карачаевск,Карачев,Каргат,Каргополь,Карпинск,Карталы,Касимов," \
                      "Касли,Каспийск,Катав-Ивановск,Катайск,Качканар,Кашин,Кашира,Кедровый,Кемерово,Кемь,Керчь," \
                      "Оспаривается,Кизел,Кизилюрт,Кизляр,Кимовск,Кимры,Кингисепп,Кинель,Кинешма,Киреевск," \
                      "Киренск,Киржач,Кириллов,Кириши,Киров,Киров,Кировград,Кирово-Чепецк,Кировск,Кировск,Кирс," \
                      "Кирсанов,Киселёвск,Кисловодск,Клин,Клинцы,Княгинино,Ковдор,Ковров,Ковылкино,Когалым," \
                      "Кодинск,Козельск,Козловка,Козьмодемьянск,Кола,Кологрив,Коломна,Колпашево,Кольчугино," \
                      "Коммунар,Комсомольск,Комсомольск-на-Амуре,Конаково,Кондопога,Кондрово,Константиновск," \
                      "Копейск,Кораблино,Кореновск,Коркино,Королёв,Короча,Корсаков,Коряжма,Костерёво,Костомукша," \
                      "Кострома,Котельники,Котельниково,Котельнич,Котлас,Котово,Котовск,Кохма,Красавино," \
                      "Красноармейск,Красноармейск,Красновишерск,Красногорск,Краснодар,Краснозаводск," \
                      "Краснознаменск,Краснознаменск,Краснокаменск,Краснокамск,Красноперекопск,Оспаривается," \
                      "Краснослободск,Краснослободск,Краснотурьинск,Красноуральск,Красноуфимск,Красноярск," \
                      "Красный Кут,Красный Сулин,Красный Холм,Кремёнки,Кропоткин,Крымск,Кстово,Кубинка,Кувандык," \
                      "Кувшиново,Кудрово,Кудымкар,Кузнецк,Куйбышев,Кукмор,Кулебаки,Кумертау,Кунгур,Купино,Курган," \
                      "Курганинск,Курильск,Курлово,Куровское,Курск,Куртамыш,Курчалой,Курчатов,Куса,Кушва,Кызыл," \
                      "Кыштым,Кяхта,Лабинск,Лабытнанги,Лагань,Ладушкин,Лаишево,Лакинск,Лангепас,Лахденпохья," \
                      "Лебедянь,Лениногорск,Ленинск,Ленинск-Кузнецкий,Ленск,Лермонтов,Лесной,Лесозаводск," \
                      "Лесосибирск,Ливны,Ликино-Дулёво,Липецк,Липки,Лиски,Лихославль,Лобня,Лодейное Поле," \
                      "Лосино-Петровский,Луга,Луза,Лукоянов,Луховицы,Лысково,Лысьва,Лыткарино,Льгов,Любань," \
                      "Люберцы,Любим,Людиново,Лянтор,Магадан,Магас,Магнитогорск,Майкоп,Майский,Макаров,Макарьев," \
                      "Макушино,Малая Вишера,Малгобек,Малмыж,Малоархангельск,Малоярославец,Мамадыш,Мамоново," \
                      "Мантурово,Мариинск,Мариинский Посад,Маркс,Махачкала,Мглин,Мегион,Медвежьегорск,Медногорск," \
                      "Медынь,Межгорье,Междуреченск,Мезень,Меленки,Мелеуз,Менделеевск,Мензелинск,Мещовск,Миасс," \
                      "Микунь,Миллерово,Минеральные Воды,Минусинск,Миньяр,Мирный,Мирный,Михайлов,Михайловка," \
                      "Михайловск,Михайловск,Мичуринск,Могоча,Можайск,Можга,Моздок,Мончегорск,Морозовск,Моршанск," \
                      "Мосальск,Москва,Муравленко,Мураши,Мурино,Мурманск,Муром,Мценск,Мыски,Мытищи,Мышкин," \
                      "Набережные Челны,Навашино,Наволоки,Надым,Назарово,Назрань,Называевск,Нальчик,Нариманов," \
                      "Наро-Фоминск,Нарткала,Нарьян-Мар,Находка,Невель,Невельск,Невинномысск,Невьянск,Нелидово," \
                      "Неман,Нерехта,Нерчинск,Нерюнгри,Нестеров,Нефтегорск,Нефтекамск,Нефтекумск,Нефтеюганск,Нея," \
                      "Нижневартовск,Нижнекамск,Нижнеудинск,Нижние Серги,Нижний Ломов,Нижний Новгород," \
                      "Нижний Тагил,Нижняя Салда,Нижняя Тура,Николаевск,Николаевск-на-Амуре,Никольск,Никольск," \
                      "Никольское,Новая Ладога,Новая Ляля,Новоалександровск,Новоалтайск,Новоаннинский," \
                      "Нововоронеж,Новодвинск,Новозыбков,Новокубанск,Новокузнецк,Новокуйбышевск,Новомичуринск," \
                      "Новомосковск,Новопавловск,Новоржев,Новороссийск,Новосибирск,Новосиль,Новосокольники," \
                      "Новотроицк,Новоузенск,Новоульяновск,Новоуральск,Новохопёрск,Новочебоксарск,Новочеркасск," \
                      "Новошахтинск,Новый Оскол,Новый Уренгой,Ногинск,Нолинск,Норильск,Ноябрьск,Нурлат,Нытва," \
                      "Нюрба,Нягань,Нязепетровск,Няндома,Облучье,Обнинск,Обоянь,Обь,Одинцово,Озёрск,Озёрск,Озёры," \
                      "Октябрьск,Октябрьский,Окуловка,Олёкминск,Оленегорск,Олонец,Омск,Омутнинск,Онега,Опочка," \
                      "Орёл,Оренбург,Орехово-Зуево,Орлов,Орск,Оса,Осинники,Осташков,Остров,Островной,Острогожск," \
                      "Отрадное,Отрадный,Оха,Оханск,Очёр,Павлово,Павловск,Павловский Посад,Палласовка,Партизанск," \
                      "Певек,Пенза,Первомайск,Первоуральск,Перевоз,Пересвет,Переславль-Залесский,Пермь,Пестово," \
                      "Петров Вал,Петровск,Петровск-Забайкальский,Петрозаводск,Петропавловск-Камчатский,Петухово," \
                      "Петушки,Печора,Печоры,Пикалёво,Пионерский,Питкяранта,Плавск,Пласт,Плёс,Поворино,Подольск," \
                      "Подпорожье,Покачи,Покров,Покровск,Полевской,Полесск,Полысаево,Полярные Зори,Полярный," \
                      "Поронайск,Порхов,Похвистнево,Почеп,Починок,Пошехонье,Правдинск,Приволжск,Приморск," \
                      "Приморск,Приморско-Ахтарск,Приозерск,Прокопьевск,Пролетарск,Протвино,Прохладный,Псков," \
                      "Пугачёв,Пудож,Пустошка,Пучеж,Пушкино,Пущино,Пыталово,Пыть-Ях,Пятигорск,Радужный,Радужный," \
                      "Райчихинск,Раменское,Рассказово,Ревда,Реж,Реутов,Ржев,Родники,Рославль,Россошь," \
                      "Ростов-на-Дону,Ростов,Рошаль,Ртищево,Рубцовск,Рудня,Руза,Рузаевка,Рыбинск,Рыбное,Рыльск," \
                      "Ряжск,Рязань,Саки,Оспаривается,Салават,Салаир,Салехард,Сальск,Самара,Санкт-Петербург," \
                      "Саранск,Сарапул,Саратов,Саров,Сасово,Сатка,Сафоново,Саяногорск,Саянск,Светлогорск," \
                      "Светлоград,Светлый,Светогорск,Свирск,Свободный,Себеж,Севастополь,Оспаривается," \
                      "Северо-Курильск,Северобайкальск,Северодвинск,Североморск,Североуральск,Северск,Севск," \
                      "Сегежа,Сельцо,Семёнов,Семикаракорск,Семилуки,Сенгилей,Серафимович,Сергач,Сергиев Посад," \
                      "Сердобск,Серов,Серпухов,Сертолово,Сибай,Сим,Симферополь,Оспаривается,Сковородино,Скопин," \
                      "Славгород,Славск,Славянск-на-Кубани,Сланцы,Слободской,Слюдянка,Смоленск,Снежинск," \
                      "Снежногорск,Собинка,Советск,Советск,Советск,Советская Гавань,Советский,Сокол,Солигалич," \
                      "Соликамск,Солнечногорск,Соль-Илецк,Сольвычегодск,Сольцы,Сорочинск,Сорск,Сортавала," \
                      "Сосенский,Сосновка,Сосновоборск,Сосновый Бор,Сосногорск,Сочи,Спас-Деменск,Спас-Клепики," \
                      "Спасск,Спасск-Дальний,Спасск-Рязанский,Среднеколымск,Среднеуральск,Сретенск,Ставрополь," \
                      "Старая Купавна,Старая Русса,Старица,Стародуб,Старый Крым,Оспаривается,Старый Оскол," \
                      "Стерлитамак,Стрежевой,Строитель,Струнино,Ступино,Суворов,Судак,Оспаривается,Суджа,Судогда," \
                      "Суздаль,Сунжа,Суоярви,Сураж,Сургут,Суровикино,Сурск,Сусуман,Сухиничи,Сухой Лог,Сызрань," \
                      "Сыктывкар,Сысерть,Сычёвка,Сясьстрой,Тавда,Таганрог,Тайга,Тайшет,Талдом,Талица,Тамбов,Тара," \
                      "Тарко-Сале,Таруса,Татарск,Таштагол,Тверь,Теберда,Тейково,Темников,Темрюк,Терек,Тетюши," \
                      "Тимашёвск,Тихвин,Тихорецк,Тобольск,Тогучин,Тольятти,Томари,Томмот,Томск,Топки,Торжок," \
                      "Торопец,Тосно,Тотьма,Трёхгорный,Троицк,Трубчевск,Туапсе,Туймазы,Тула,Тулун,Туран,Туринск," \
                      "Тутаев,Тында,Тырныауз,Тюкалинск,Тюмень,Уварово,Углегорск,Углич,Удачный,Удомля,Ужур," \
                      "Узловая,Улан-Удэ,Ульяновск,Унеча,Урай,Урень,Уржум,Урус-Мартан,Урюпинск,Усинск,Усмань," \
                      "Усолье-Сибирское,Усолье,Уссурийск,Усть-Джегута,Усть-Илимск,Усть-Катав,Усть-Кут," \
                      "Усть-Лабинск,Устюжна,Уфа,Ухта,Учалы,Уяр,Фатеж,Феодосия,Оспаривается,Фокино,Фокино,Фролово," \
                      "Фрязино,Фурманов,Хабаровск,Хадыженск,Ханты-Мансийск,Харабали,Харовск,Хасавюрт,Хвалынск," \
                      "Хилок,Химки,Холм,Холмск,Хотьково,Цивильск,Цимлянск,Циолковский,Чадан,Чайковский,Чапаевск," \
                      "Чаплыгин,Чебаркуль,Чебоксары,Чегем,Чекалин,Челябинск,Чердынь,Черемхово,Черепаново," \
                      "Череповец,Черкесск,Чёрмоз,Черноголовка,Черногорск,Чернушка,Черняховск,Чехов,Чистополь," \
                      "Чита,Чкаловск,Чудово,Чулым,Чусовой,Чухлома,Шагонар,Шадринск,Шали,Шарыпово,Шарья,Шатура," \
                      "Шахты,Шахунья,Шацк,Шебекино,Шелехов,Шенкурск,Шилка,Шимановск,Шиханы,Шлиссельбург,Шумерля," \
                      "Шумиха,Шуя,Щёкино,Щёлкино,Оспаривается,Щёлково,Щигры,Щучье,Электрогорск,Электросталь," \
                      "Электроугли,Элиста,Энгельс,Эртиль,Югорск,Южа,Южно-Сахалинск,Южно-Сухокумск,Южноуральск," \
                      "Юрга,Юрьев-Польский,Юрьевец,Юрюзань,Юхнов,Ядрин,Якутск,Ялта,Оспаривается,Ялуторовск,Янаул," \
                      "Яранск,Яровое,Ярославль,Ярцево,Ясногорск,Ясный,Яхрома"

    allowed_domains: List = [
        '2gis.ru',
    ]
    start_urls: List = [
        'https://2gis.ru',
    ]
    cookie_flag = True
    custom_settings = {
        'BOT_NAME': 'Thank you so much!',
        'ROBOTSTXT_OBEY': False,
        'URLLENGTH_LIMIT': 4166,
        'CONCURRENT_REQUESTS': 1,  # Для селениума, чтобы не параллелило
        'DOWNLOAD_DELAY': 0.50,
        'COOKIES_ENABLED': False,
    }

    def start_requests(self):
        for city in self.cities.split(','):
            yield Request(
                url=self.start_urls[0],
                callback=self.parse_city_category,
                cb_kwargs={'city': city},
                dont_filter=True
            )

    def parse_city_category(self, response: Response, **kwargs):
        for category in self.categories.split(','):
            time.sleep(3)
            yield Request(
                url=urljoin(self.start_urls[0], f'search/{kwargs.get("city")}%20{category}'),
                callback=self.parse_companies,
                cb_kwargs={'city': kwargs.get('city'), 'category': category},
                dont_filter=True
            )

    def parse_companies(self, response: Response, **kwargs):
        yield SeleniumRequest(
            url=response.url,
            callback=self.parse_by_city_and_category_companies,
            cb_kwargs={'city': kwargs.get('city'), 'category': kwargs.get('category')},
        )

    def parse_by_city_and_category_companies(self, response: Response, **kwargs):
        driver: WebDriver = response.request.meta['driver']
        city: str = kwargs.get('city')
        category: str = kwargs.get('category')
        urls: List = []
        if self.cookie_flag:
            accept_cookie(driver)
            self.cookie_flag = False
        while True:
            logger.info(f"parse_by_city_and_category_companies: City - {city} Category - {category}")
            urls_xpath: List[Selector] = driver.find_elements_by_xpath(xpath.companies_urls)
            if urls_xpath:
                if len(urls_xpath) == 12:
                    [urls.append({'href': url.get_attribute('href'), 'city': city, 'category': category}) for url in
                     urls_xpath]
                    driver.find_element_by_xpath(xpath.next_page).click()
                    time.sleep(1)
                else:
                    [urls.append({'href': url.get_attribute('href'), 'city': city, 'category': category}) for url in
                     urls_xpath]
                    break
        if urls:
            for url in urls:
                yield Request(
                    url=url['href'],
                    callback=self.parse_company_detail_page,
                    cb_kwargs={'city': url['city'], 'category': url['category']}
                )

    def parse_company_detail_page(self, response: Response, **kwargs) -> ItemLoader:
        loader: ItemLoader = ItemLoader(item=CompanyItem(), response=response)
        loader.add_value('category', kwargs.get('category'))
        loader.add_value('city', kwargs.get('city'))
        loader.add_xpath('site', xpath.company_site)
        loader.add_xpath('name', xpath.company_name)
        loader.add_xpath('email', xpath.company_email)
        loader.add_xpath('phones', xpath.company_phones)
        loader.add_xpath('social', xpath.company_social)
        return loader.load_item()


def accept_cookie(driver: WebDriver) -> None:
    try:
        accept_cookie_submit: Selector = driver.find_element_by_xpath(xpath.accept_cookie)
        accept_cookie_submit.click()
        time.sleep(3)
    except NoSuchElementException as e:
        logger.error(e, exc_info=True)
